In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])

In [4]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [5]:
ser2 = ser1.reindex(['A','B','C','D','E',"F"])

In [6]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [7]:
#filling values for new indexes
ser2.reindex(['A','B',"C",'D',"F",'G'],fill_value=0) 
# G as new index get value 0

A    1.0
B    2.0
C    3.0
D    4.0
F    NaN
G    0.0
dtype: float64

In [9]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

In [10]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [11]:
ranger = range(15)
ranger

range(0, 15)

In [14]:
ranger

range(0, 15)

In [16]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [19]:
dframe = DataFrame(randn(25).reshape((5,5)),index = ['A','B','D','E','F'],columns = ['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -1.606463 -1.862758 -0.053564 -0.500128  0.344759
B  1.023777  1.201140  0.821851 -0.927717  0.293569
D -2.079258  1.494608 -0.705032 -0.088787  0.435014
E  2.023458 -0.831352 -0.095137 -0.018700  0.152035
F -0.644378  0.197222  0.000150 -0.604410 -0.556383

In [20]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])
dframe2

       col1      col2      col3      col4      col5
A -1.606463 -1.862758 -0.053564 -0.500128  0.344759
B  1.023777  1.201140  0.821851 -0.927717  0.293569
C       NaN       NaN       NaN       NaN       NaN
D -2.079258  1.494608 -0.705032 -0.088787  0.435014
E  2.023458 -0.831352 -0.095137 -0.018700  0.152035
F -0.644378  0.197222  0.000150 -0.604410 -0.556383

In [21]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [22]:
dframe.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -1.606463 -1.862758 -0.053564 -0.500128  0.344759   NaN
B  1.023777  1.201140  0.821851 -0.927717  0.293569   NaN
D -2.079258  1.494608 -0.705032 -0.088787  0.435014   NaN
E  2.023458 -0.831352 -0.095137 -0.018700  0.152035   NaN
F -0.644378  0.197222  0.000150 -0.604410 -0.556383   NaN

In [23]:
dframe

       col1      col2      col3      col4      col5
A -1.606463 -1.862758 -0.053564 -0.500128  0.344759
B  1.023777  1.201140  0.821851 -0.927717  0.293569
D -2.079258  1.494608 -0.705032 -0.088787  0.435014
E  2.023458 -0.831352 -0.095137 -0.018700  0.152035
F -0.644378  0.197222  0.000150 -0.604410 -0.556383

In [27]:
dframe.loc[['A','B','C','D',"E",'F'],new_columns]

       col1      col2      col3      col4      col5  col6
A -1.606463 -1.862758 -0.053564 -0.500128  0.344759   NaN
B  1.023777  1.201140  0.821851 -0.927717  0.293569   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -2.079258  1.494608 -0.705032 -0.088787  0.435014   NaN
E  2.023458 -0.831352 -0.095137 -0.018700  0.152035   NaN
F -0.644378  0.197222  0.000150 -0.604410 -0.556383   NaN